#include"UART1.h"

uchar RXData;;
/*
*********************************************************************************************************
*	函 数 名: UART1_Init
*	功能说明: UART1初始化
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void UART_Init(void)
{
    /* UART1模式寄存器 */
    U1MODE = 0x0000;//8位数据 无奇偶校验 1停止位
    U1MODEbits.USIDL=0;   //空闲模式下继续运行
    
    U1MODEbits.ALTIO=0;   //UART1通过U1TX和U1RX的IO通信
    //U1MODEbits.ALTIO=1;   //UART1通过U1ATX和U1ARX的IO通信-备用IO
    
    U1MODEbits.WAKE  =0;  //在休眠模式期间检测到启动位唤醒使能位
    U1MODEbits.LPBACK=0;  //禁止环回模式
    U1MODEbits.ABAUD =0;  //从ICx引脚输入到捕捉模块
    U1MODEbits.PDSEL =0;  //8位数据,无奇偶校验
    U1MODEbits.STSEL =0;  //1个停止位
        
    U1MODEbits.UARTEN=1;  //使能UART1
    
    /* UART1状态和控制寄存器 */
    U1STAbits.UTXISEL=0;  //当一个字符传输到发送移位寄存器时，产生中断
    U1STAbits.UTXBRK =0;  //U1TX引脚正常工作
    U1STAbits.URXISEL=0;  //当接收到一个字符时，中断标志位置位
    U1STAbits.ADDEN  =0;  //地址检测模式禁止
   
    /* U1BRG波特率寄存器 */
    U1BRG = 49;// U1BRG = ( Fcy / (16 * 9600) ) - 1  Fcy = 系统时钟/4
    
    IEC0bits.U1TXIE = 1;//发送中断允许
    IPC2bits.U1TXIP = 7;//发送中断优先级7
    
    IEC0bits.U1RXIE = 1;//接收中断允许
    IPC2bits.U1RXIP = 6;//接收中断优先级6
    
    U1STAbits.UTXEN = 1;// 使能发送
     
}

/*
*********************************************************************************************************
*	函 数 名: UART1_TX
*	功能说明: UART1发送一个字节
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void UART1_TX(uchar TXData)//发送数据
{
    while (U1STAbits.UTXBF);
        U1TXREG = TXData;
}



/*
*********************************************************************************************************
*	函 数 名: _U1TXInterrupt
*	功能说明: U1发送完成中断
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void __attribute__((__interrupt__, auto_psv)) _U1TXInterrupt(void)//发送中断
{
    IFS0bits.U1TXIF = 0;	//清中断标志
}

/*
*********************************************************************************************************
*	函 数 名: _U1RXInterrupt
*	功能说明: U1接收完成中断
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void __attribute__((__interrupt__, auto_psv)) _U1RXInterrupt(void)//接收中断
{
    IFS0bits.U1RXIF = 0; //清中断标志
    RXData = U1RXREG;
    UART1_TX(RXData);
}