#include"INT0.h"

/*
*********************************************************************************************************
*	函 数 名: INT0_Init
*	功能说明: INT0配置初始化
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void INT0_Init(void)
{   
    TRISBbits.TRISB1 = 0;   //RB1配置输出   
    TRISEbits.TRISE8 = 1;   //RE8配置为输入（RE8的复用功能是INT0）
    
    INTCON1bits.NSTDIS = 1; //禁止中断嵌套    
    INTCON2bits.INT0EP = 1; //INTO下降沿触发
    IEC0bits.INT0IE = 1;    //允许INTO外部中断
    IPC0bits.INT0IP = 7;    //INTO的中断优先级为7，最高优先级
    IFS0bits.INT0IF = 0;    //清INTO外部中断标志
}

/*
*********************************************************************************************************
*	函 数 名: _INT0Interrupt
*	功能说明: INT0外部触发中断
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void __attribute__((__interrupt__, auto_psv)) _INT0Interrupt(void)
{
    IFS0bits.INT0IF = 0;    //清INTO外部中断标志
}